D_A_T/API_FUNCS/SOAPTemps/CitizenDIVA.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:eng="http://teradata.com/rta/engagementPlatform">
   <soapenv:Header/>
   <soapenv:Body>
      <eng:serviceInquiryRequest>
      <eng:G2GHeader>
            <eng:correlationId>APIsAutomationTesting</eng:correlationId>
            <eng:originatingChannel>?</eng:originatingChannel>
            <eng:channelRequestId>?</eng:channelRequestId>
            <eng:originatingUserType>?</eng:originatingUserType>
            <eng:originatingUserIdentifier>?</eng:originatingUserIdentifier>
            <eng:serviceSlug>ServiceSlug_value</eng:serviceSlug>
         </eng:G2GHeader>
         <eng:serviceID>CitizenDIVA</eng:serviceID>
         <eng:clientID>DigitalIdentity</eng:clientID>
         <eng:parameters>
            <eng:parameter>
               <eng:key>NATIONALID</eng:key>
               <eng:value>NATIONALID_Value</eng:value>
               </eng:parameter>
                <eng:parameter>
               <eng:key>Question1Code</eng:key>
               <eng:value>Question1Code_Value</eng:value>
               </eng:parameter>
                <eng:parameter>
               <eng:key>Answer1</eng:key>
               <eng:value>Answer1_Value</eng:value>
               </eng:parameter>
                <eng:parameter>
               <eng:key>Question2Code</eng:key>
               <eng:value></eng:value>
               </eng:parameter>
                <eng:parameter>
               <eng:key>Answer2</eng:key>
               <eng:value></eng:value>
               </eng:parameter>
                <eng:parameter>
               <eng:key>Question3Code</eng:key>
               <eng:value></eng:value>
            </eng:parameter>
             <eng:parameter>
               <eng:key>Answer3</eng:key>
               <eng:value></eng:value>
            </eng:parameter>
         </eng:parameters>
      </eng:serviceInquiryRequest>
   </soapenv:Body>
</soapenv:Envelope>